watsonlr/namebadge-apps/arduino/BYUI-Namebadge-Board/boards.txt

byui_namebadge.name=BYUI eBadge V4

byui_namebadge.vid.0=0x10C4
byui_namebadge.pid.0=0xEA60

byui_namebadge.upload.tool=esptool_py
byui_namebadge.upload.tool.default=esptool_py
byui_namebadge.upload.maximum_size=1310720
byui_namebadge.upload.maximum_data_size=327680
byui_namebadge.upload.speed=460800
byui_namebadge.upload.before_reset=default-reset
byui_namebadge.upload.after_reset=hard-reset
byui_namebadge.upload.use_1200bps_touch=false
byui_namebadge.upload.wait_for_upload_port=false
byui_namebadge.upload.flags=
byui_namebadge.upload.extra_flags=
byui_namebadge.upload.erase_cmd=

byui_namebadge.serial.disableDTR=false
byui_namebadge.serial.disableRTS=false

byui_namebadge.build.tarch=xtensa
byui_namebadge.build.target=esp32s3
byui_namebadge.build.mcu=esp32s3
byui_namebadge.build.core=esp32:esp32
byui_namebadge.build.variant=esp32s3
byui_namebadge.build.board=BYUI_NAMEBADGE_V4
byui_namebadge.build.arch=ESP32

byui_namebadge.build.bootloader_addr=0x0
byui_namebadge.build.flash_size=4MB
byui_namebadge.build.flash_freq=80m
byui_namebadge.build.flash_mode=dio
byui_namebadge.build.boot=qio
byui_namebadge.build.boot_freq=80m

byui_namebadge.build.partitions=byui_badge

byui_namebadge.build.psram_type=opi
byui_namebadge.build.memory_type={build.boot}_{build.psram_type}
byui_namebadge.build.defines=-DBOARD_HAS_PSRAM

byui_namebadge.build.usb_mode=1
byui_namebadge.build.cdc_on_boot=1
byui_namebadge.build.msc_on_boot=0
byui_namebadge.build.dfu_on_boot=0

byui_namebadge.build.f_cpu=240000000L
byui_namebadge.build.loop_core=
byui_namebadge.build.event_core=

